alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/svd/ATSAML21J18B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <version>2.0.0</version>
      <description>Advanced Encryption Standard</description>
      <groupName>AES</groupName>
      <prependToName>AES_</prependToName>
      <baseAddress>0x42003400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AES</name>
        <value>26</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AESMODE</name>
              <description>AES Modes of operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CFBS</name>
              <description>CFB Types</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>KEYSIZE</name>
              <description>Keysize</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CIPHER</name>
              <description>Cipher mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STARTMODE</name>
              <description>Start mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOD</name>
              <description>LOD Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEYGEN</name>
              <description>Last key generation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XORKEY</name>
              <description>Xor Key operation</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTYPE</name>
              <description>Counter measure types</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>START</name>
              <description>Manual Start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NEWMSG</name>
              <description>New message</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOM</name>
              <description>End of message</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFMUL</name>
              <description>GF Multiplication</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENCCMP</name>
              <description>Encryption Complete</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFMCMP</name>
              <description>GF Multiplication Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENCCMP</name>
              <description>Encryption Complete</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFMCMP</name>
              <description>GF Multiplication Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status</description>
          <addressOffset>0x07</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENCCMP</name>
              <description>Encryption Complete</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFMCMP</name>
              <description>GF Multiplication Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFPTR</name>
          <description>Data buffer pointer</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>INDATAPTR</name>
              <description>Input Data Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug control</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>KEYWORD%s</name>
          <description>Keyword n</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>INDATA</name>
          <description>Indata</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>INTVECTV%s</name>
          <description>Initialisation Vector n</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>HASHKEY%s</name>
          <description>Hash key n</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GHASH%s</name>
          <description>Galois Hash n</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>CIPLEN</name>
          <description>Cipher Length</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RANDSEED</name>
          <description>Random Seed</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
        </register>
